meeting/minutes/2022/11-15.org
:PROPERTIES:
:ID:       44769F21-C107-4859-A2E0-32AC34CAB2DF
:END:
#+title: QT4 CG Meeting 011 Minutes 2022-11-15
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Summary of new and continuing actions [1/8]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-011-01: MK to fix the reference to “function” in XPath 4.4.1.
+ [ ] QT4CG-011-02: CG to work with DN to propose an “until” variant.
+ [ ] QT4CG-011-03: MK to change the references to URI qualified name in both QName-related functions.
+ [ ] QT4CG-011-04: NW to define the parse-uri/build-uri record types in a separate section
+ [ ] QT4CG-011-05: NW to update the history for parse-uri/build-uri to indicate that details are still being resolved
+ [ ] QT4CG-011-06: NW to make sure ednotes are rendered.
+ [X] QT4CG-011-07: NW to make sure the meeting passcode is on the logistics page
  + This is already the case

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [10/13]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets BTW

+ [X] Anthony (Tony) Bufort (AB)
+ [X] Reece Dunn (RD)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK) [0:15-]
+ [X] Michael Kay (MK)
+ [X] John Lumley (JL)
+ [X] Dimitre Novatchev (DN)
+ [X] Ed Porter (EP)
+ [ ] Liam Quin (LQ)
+ [ ] Adam Retter
+ [X] C. M. Sperberg-McQueen (MSM)
+ [ ] Bethan Tovey-Walsh (BTW). /Scribe/. /Chair/.
+ [X] Norm Tovey-Walsh (NW)

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2022/11-15.html][the agenda]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting [[../../agenda/2022/11-22.html][is scheduled for Tuesday, 22 November]].

Regrets: JL for 22 and 29 November.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2022/11-08.html][the minutes of the previous meeting]].

Accepted.

** Review of open action items [7/8]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [X] QT4CG-007-05: NW to make an issue for Martin’s proposed ammendment to map:build
  + See [[https://github.com/qt4cg/qtspecs/issues/236][issue #236]].
+ [X] QT4CG-008-04: MK to submit a PR for ~fn:parseQName()~ to resolve PR #207
  + Mike reports the action is complete in PR #207
+ [X] QT4CG-009-01: NW to coordinate with MK on an agenda for 8 November.
+ [X] QT4CG-009-02: NW to work with MK to make sure PR #197 is updated correctly
+ [X] NW to update PR #215
  + [X] QT4CG-009-03: NW to investigate the relationship between PR #215 and =resolve-uri=.
  + [X] QT4CG-009-04: NW to review RFC 3896 wrt relative URIs
  + [X] QT4CG-009-05: NW to fix the return type for =parse-uri=; consider using a record type.
  + [X] QT4CG-009-06: NW to add error tests for =parse-uri=.
  + [X] QT4CG-009-07: NW to make the query segments an array of maps.
+ [X] QT4CG-010-01: DN to create an issue for proposing an optional else in XPath/XQuery
+ [X] QT4CG-010-02: MK to incorporate the suggestions made by MSM on @then/@else on xsl:if
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Nov/0013.html

