meeting/minutes/2022/11-15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 011 Minutes 2022-11-15</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 011 Minutes 2022-11-15</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[1/8]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[10/13]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#next-meeting">1.3. Next meeting</a></li>
<li><a href="#approve-minutes">1.4. Approve minutes of the previous meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[7/8]</code></a></li>
<li><a href="#merging-prs">1.6. Merging PRs that are accepted in principle</a></li>
<li><a href="#meeting-logistics">1.7. Meeting logistics</a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#pr-variadic-functions">2.1. Review pull request #197 (was 166; variadic functions)</a></li>
<li><a href="#pr-fn-while">2.2. Review pull request #210: Issue 80: fn:while</a></li>
<li><a href="#pr-subtyping">2.3. Review pull request #202 (was 196; subtyping)</a></li>
<li><a href="#h-743C4A9D-BAEF-4C75-A412-BDFAA9C89856">2.4. Review pull request #207: new expanded-QName function</a></li>
<li><a href="#h-11CAAAFD-8175-4D10-83FA-BEC6AA3312A6">2.5. Review pull request #215: parse-uri/build-uri</a></li>
<li><a href="#h-04B58DC1-A005-4AD5-83F0-B3BCE110FB76">2.6. Review pull request #222: sequence comparisons</a></li>
<li><a href="#h-37009862-494E-4CCE-9FA7-DE5B2E9F8474">2.7. Review pull request #228: make F&amp;O spec valid XML</a></li>
<li><a href="#h-A132F93F-0414-4495-A868-A7F32A6D642A">2.8. Review pull request #230: guarded expressions, issue #71</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="./11-22.html">at meeting 012</a> on 22 November 2022.
</p>
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[1/8]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-011-01: MK to fix the reference to “function” in XPath 4.4.1.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-011-02: CG to work with DN to propose an “until” variant.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-011-03: MK to change the references to URI qualified name in both QName-related functions.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-011-04: NW to define the parse-uri/build-uri record types in a separate section</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-011-05: NW to update the history for parse-uri/build-uri to indicate that details are still being resolved</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-011-06: NW to make sure ednotes are rendered.</li>
<li class="on"><code>[X]</code> QT4CG-011-07: NW to make sure the meeting passcode is on the logistics page
<ul class="org-ul">
<li>This is already the case</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[10/13]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets BTW
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Anthony (Tony) Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) [0:15-]</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="off"><code>[&#xa0;]</code> Adam Retter</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2022/11-15.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2022/11-22.html">is scheduled for Tuesday, 22 November</a>.
</p>

<p>
Regrets: JL for 22 and 29 November.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/11-08.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[7/8]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="on"><code>[X]</code> QT4CG-007-05: NW to make an issue for Martin’s proposed ammendment to map:build
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/236">issue #236</a>.</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-008-04: MK to submit a PR for <code>fn:parseQName()</code> to resolve PR #207
<ul class="org-ul">
<li>Mike reports the action is complete in PR #207</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-009-01: NW to coordinate with MK on an agenda for 8 November.</li>
<li class="on"><code>[X]</code> QT4CG-009-02: NW to work with MK to make sure PR #197 is updated correctly</li>
<li class="on"><code>[X]</code> NW to update PR #215
<ul class="org-ul">
<li class="on"><code>[X]</code> QT4CG-009-03: NW to investigate the relationship between PR #215 and <code>resolve-uri</code>.</li>
<li class="on"><code>[X]</code> QT4CG-009-04: NW to review RFC 3896 wrt relative URIs</li>
<li class="on"><code>[X]</code> QT4CG-009-05: NW to fix the return type for <code>parse-uri</code>; consider using a record type.</li>
<li class="on"><code>[X]</code> QT4CG-009-06: NW to add error tests for <code>parse-uri</code>.</li>
<li class="on"><code>[X]</code> QT4CG-009-07: NW to make the query segments an array of maps.</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-010-01: DN to create an issue for proposing an optional else in XPath/XQuery</li>
<li class="on"><code>[X]</code> QT4CG-010-02: MK to incorporate the suggestions made by MSM on @then/@else on xsl:if
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Nov/0013.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Nov/0013.html</a></li>
</ul></li>
</ul>
</div>
</div>
