meeting/minutes/2022/11-15.org
** Merging PRs that are accepted in principle
:PROPERTIES:
:CUSTOM_ID: merging-prs
:END:

We’ve been keeping PRs open while detailed comments are worked out. I
think that’s a fine model, but it has the consequence that we end up
with a lot of PRs open for a long time. That increases the chances
that we’ll create merge conflicts, making our life more difficult
later, and means that there are many slightly different copies of each
spec to review.

I propose that we agree to merge PRs as soon as the group feels that
the proposal is complete enough to accept in principle. We can add a
note in the history (for functions, at least) that it’s provisionally
accepted until detailed comments are resolved, or words to that
effect.

In the very short term, I would especially like to merge all of the
PRs that are open against F&O so that the XML validity errors and the
new markup for “type references” can be sorted out.

+ RD: That makes sense
+ JL: Where do discussions happen?
+ NW: I think we get discussion in the issues until there’s a PR, then
  on the PR.
+ MSM: In groups that I have been in that use a two-pass approach, the
  point of not considering things changed until the wording is all correct, one side
  effect is that if there are minor side effects in the wording, 
  if we merge earlier, is there a way to ensure that nits don’t fall under the table?
+ MK: I’ve usually seen that managed through actions
+ MSM: Okay.
+ NW: At least in F&O, we have a history section where we can observe
  that it’s unresolved.
+ MK: XMLSpec also has an ednote; we could render them.

ACTION QT4CG-011-06: NW to make sure ednotes are rendered.

Proposal: merge PRs when they’re accepted in principle.

Agreed.

** Meeting logistics
:PROPERTIES:
:CUSTOM_ID: meeting-logistics
:END:

DN observes that he had trouble getting into the meeting. There was a
different Zoom link and passcode last week and, for some reason, Zoom
asked DN for a passcode this week.

ACTION QT4CG-011-07: NW to make sure the meeting passcode is on the logistics page

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Review pull request #197 (was 166; variadic functions)
:PROPERTIES:
:CUSTOM_ID: pr-variadic-functions
:END:

+ See [[https://qt4cg.org/dashboard/#pr-197][pull request #197]] (you’ll find links to formatted versions of the specs at [[https://qt4cg.org/]]).
+ See also the nexus of issues [[https://github.com/qt4cg/qtspecs/issues/162][#162]], [[https://github.com/qt4cg/qtspecs/issues/161][#161]], [[https://github.com/qt4cg/qtspecs/issues/160][#160]], [[https://github.com/qt4cg/qtspecs/issues/159][#159]], [[https://github.com/qt4cg/qtspecs/issues/158][#158]], [[https://github.com/qt4cg/qtspecs/issues/157][#157]], and [[https://github.com/qt4cg/qtspecs/issues/155][#155]].
+ See the discussion from [[../../minutes/2022/10-11.html#pr-variadic-functions][meeting 006]], [[../../minutes/2022/10-18.html#pr-variadic-functions][meeting 007]], and [[../../minutes/2022/10-25.html#pr-variadic-functions][meeting 008]].

NW updated the PR with MK’s most recent changes.

We hope to resolve this PR this week.

+ MSM: I noticed that somewhere in the middle, some of the new text
  uses the unqualified term “function” and it caught my eye partly
  because early on in this pull requestion there’s a note that we use
  the term “function item”. Was that change intentional, or does it
  need a tweak?
+ MK: This crosses a couple of PRs. The Data Model uses the term
  “function” to mean an item. I’ve for the moment stuck to that, but
  I’ve also proposed changing it otherwise it gets too confused with
  static functions which aren’t function items.
+ MSM: I had the impression that in a lot of cases in this PR we were
  using function item.
+ MK: Yes, but it’s probably not uniformly applied.
+ MSM: I’m pretty sure that the bit that caught my eye was “apropos of
  lookup” where there’s a reference that’s neither to a function
  definition or a function item, just a “function”.

Subsequent discussion reveals that the editor thinks the sentence is
(too?) informal.

ACTION QT4CG-011-01: MK to fix the reference to “function” in XPath 4.4.1.

+ RD: Looking through the grammar, the function signature with
  defaults is a sequence of param with defaults with optional default
  values. So according the grammar you can interleave optional and
  non-optional parameters. But elsewhere we say that required ones
  have to come first.
+ MK: I decided to make that an extra-grammatical rule.
+ RD: That makes sense, the grammar is difficult to get right.
+ NW: An action to add it to A.1.2?
+ MK: No, I don’t think that’s necessary. We have too many constraints
  like this that aren’t mentioned.

Proposal: Accept this PR?

Accepted.

** Review pull request #210: Issue 80: fn:while
:PROPERTIES:
:CUSTOM_ID: pr-fn-while
:END:

+ See [[https://qt4cg.org/dashboard/#pr-210][pull request #210]] and the [[../../minutes/2022/11-01.html#pr-fn-while][minutes of two weeks ago]].

We hope to resolve this PR this week.

+ CG: I renamed the function from ~fn:while~ to ~fn:iterate-while~ per
  DN. Most use cases can be realized with this function, so I haven’t
  explored the until variant.
+ MSM: The one question I have relates to a remark that MK made. If
  you want to generate a sequence of items until something happens, is
  there a way to do that using ~fn:iterate-while~. This isn’t a reason
  not to accept the proposal, I’m just curious.
+ CG: I think it’s absolutely possible, you can generate any kind of
  data structure you want. You can pass the sequence along, etc.

Proposal: Accept this PR?

+ DN: I think that it would be good to discuss ~fn:iterate-until~ now.
+ MK: Do we have a spec for ~fn:iterate-until~?
+ MSM: How would it be different?
+ DN: The condition is just the opposite condition.
+ CG: We also talked about having the action performed at least once.
  Then we wouldn’t need to negate the predicate.
+ MK: Point of order: there’s no proposal for this.

ACTION QT4CG-011-02: CG to work with DN to propose an “until” variant.

Proposal: Accept *this* PR?

Accepted.

