meeting/minutes/2022/11-15.html

<div id="outline-container-merging-prs" class="outline-3">
<h3 id="merging-prs"><span class="section-number-3">1.6.</span> Merging PRs that are accepted in principle</h3>
<div class="outline-text-3" id="text-merging-prs">
<p>
We’ve been keeping PRs open while detailed comments are worked out. I
think that’s a fine model, but it has the consequence that we end up
with a lot of PRs open for a long time. That increases the chances
that we’ll create merge conflicts, making our life more difficult
later, and means that there are many slightly different copies of each
spec to review.
</p>

<p>
I propose that we agree to merge PRs as soon as the group feels that
the proposal is complete enough to accept in principle. We can add a
note in the history (for functions, at least) that it’s provisionally
accepted until detailed comments are resolved, or words to that
effect.
</p>

<p>
In the very short term, I would especially like to merge all of the
PRs that are open against F&amp;O so that the XML validity errors and the
new markup for “type references” can be sorted out.
</p>

<ul class="org-ul">
<li>RD: That makes sense</li>
<li>JL: Where do discussions happen?</li>
<li>NW: I think we get discussion in the issues until there’s a PR, then
on the PR.</li>
<li>MSM: In groups that I have been in that use a two-pass approach, the
point of not considering things changed until the wording is all correct, one side
effect is that if there are minor side effects in the wording, 
if we merge earlier, is there a way to ensure that nits don’t fall under the table?</li>
<li>MK: I’ve usually seen that managed through actions</li>
<li>MSM: Okay.</li>
<li>NW: At least in F&amp;O, we have a history section where we can observe
that it’s unresolved.</li>
<li>MK: XMLSpec also has an ednote; we could render them.</li>
</ul>

<p>
ACTION QT4CG-011-06: NW to make sure ednotes are rendered.
</p>

<p>
Proposal: merge PRs when they’re accepted in principle.
</p>

<p>
Agreed.
</p>
</div>
</div>

<div id="outline-container-meeting-logistics" class="outline-3">
<h3 id="meeting-logistics"><span class="section-number-3">1.7.</span> Meeting logistics</h3>
<div class="outline-text-3" id="text-meeting-logistics">
<p>
DN observes that he had trouble getting into the meeting. There was a
different Zoom link and passcode last week and, for some reason, Zoom
asked DN for a passcode this week.
</p>

<p>
ACTION QT4CG-011-07: NW to make sure the meeting passcode is on the logistics page
</p>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-variadic-functions" class="outline-3">
<h3 id="pr-variadic-functions"><span class="section-number-3">2.1.</span> Review pull request #197 (was 166; variadic functions)</h3>
<div class="outline-text-3" id="text-pr-variadic-functions">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-197">pull request #197</a> (you’ll find links to formatted versions of the specs at <a href="https://qt4cg.org/">https://qt4cg.org/</a>).</li>
<li>See also the nexus of issues <a href="https://github.com/qt4cg/qtspecs/issues/162">#162</a>, <a href="https://github.com/qt4cg/qtspecs/issues/161">#161</a>, <a href="https://github.com/qt4cg/qtspecs/issues/160">#160</a>, <a href="https://github.com/qt4cg/qtspecs/issues/159">#159</a>, <a href="https://github.com/qt4cg/qtspecs/issues/158">#158</a>, <a href="https://github.com/qt4cg/qtspecs/issues/157">#157</a>, and <a href="https://github.com/qt4cg/qtspecs/issues/155">#155</a>.</li>
<li>See the discussion from <a href="../../minutes/2022/10-11.html#pr-variadic-functions">meeting 006</a>, <a href="../../minutes/2022/10-18.html#pr-variadic-functions">meeting 007</a>, and <a href="../../minutes/2022/10-25.html#pr-variadic-functions">meeting 008</a>.</li>
</ul>

<p>
NW updated the PR with MK’s most recent changes.
</p>

<p>
We hope to resolve this PR this week.
</p>

<ul class="org-ul">
<li>MSM: I noticed that somewhere in the middle, some of the new text
uses the unqualified term “function” and it caught my eye partly
because early on in this pull requestion there’s a note that we use
the term “function item”. Was that change intentional, or does it
need a tweak?</li>
<li>MK: This crosses a couple of PRs. The Data Model uses the term
“function” to mean an item. I’ve for the moment stuck to that, but
I’ve also proposed changing it otherwise it gets too confused with
static functions which aren’t function items.</li>
<li>MSM: I had the impression that in a lot of cases in this PR we were
using function item.</li>
<li>MK: Yes, but it’s probably not uniformly applied.</li>
<li>MSM: I’m pretty sure that the bit that caught my eye was “apropos of
lookup” where there’s a reference that’s neither to a function
definition or a function item, just a “function”.</li>
</ul>

<p>
Subsequent discussion reveals that the editor thinks the sentence is
(too?) informal.
</p>

<p>
ACTION QT4CG-011-01: MK to fix the reference to “function” in XPath 4.4.1.
</p>

<ul class="org-ul">
<li>RD: Looking through the grammar, the function signature with
defaults is a sequence of param with defaults with optional default
values. So according the grammar you can interleave optional and
non-optional parameters. But elsewhere we say that required ones
have to come first.</li>
<li>MK: I decided to make that an extra-grammatical rule.</li>
<li>RD: That makes sense, the grammar is difficult to get right.</li>
<li>NW: An action to add it to A.1.2?</li>
<li>MK: No, I don’t think that’s necessary. We have too many constraints
like this that aren’t mentioned.</li>
</ul>

<p>
Proposal: Accept this PR?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-fn-while" class="outline-3">
<h3 id="pr-fn-while"><span class="section-number-3">2.2.</span> Review pull request #210: Issue 80: fn:while</h3>
<div class="outline-text-3" id="text-pr-fn-while">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-210">pull request #210</a> and the <a href="../../minutes/2022/11-01.html#pr-fn-while">minutes of two weeks ago</a>.</li>
</ul>

<p>
We hope to resolve this PR this week.
</p>

<ul class="org-ul">
<li>CG: I renamed the function from <code>fn:while</code> to <code>fn:iterate-while</code> per
DN. Most use cases can be realized with this function, so I haven’t
explored the until variant.</li>
<li>MSM: The one question I have relates to a remark that MK made. If
you want to generate a sequence of items until something happens, is
there a way to do that using <code>fn:iterate-while</code>. This isn’t a reason
not to accept the proposal, I’m just curious.</li>
<li>CG: I think it’s absolutely possible, you can generate any kind of
data structure you want. You can pass the sequence along, etc.</li>
</ul>

<p>
Proposal: Accept this PR?
</p>

<ul class="org-ul">
<li>DN: I think that it would be good to discuss <code>fn:iterate-until</code> now.</li>
<li>MK: Do we have a spec for <code>fn:iterate-until</code>?</li>
<li>MSM: How would it be different?</li>
<li>DN: The condition is just the opposite condition.</li>
<li>CG: We also talked about having the action performed at least once.
Then we wouldn’t need to negate the predicate.</li>
<li>MK: Point of order: there’s no proposal for this.</li>
</ul>

<p>
ACTION QT4CG-011-02: CG to work with DN to propose an “until” variant.
</p>

<p>
Proposal: Accept <b>this</b> PR?
</p>

<p>
Accepted.
</p>
</div>
</div>
