meeting/minutes/2022/11-15.org
** Review pull request #202 (was 196; subtyping)
:PROPERTIES:
:CUSTOM_ID: pr-subtyping
:END:

See [[https://qt4cg.org/dashboard/#pr-202][pull request #202]]

+ MK: The principle changes are to the section on defining subtyping
  rules. There were two major comments on the original proposal: lots
  of good detail from RD and a question of the fundamental nature of
  atomic values from MSM. I propose to address the latter in a
  different issue. 
  + … This primarily addresses the subtyping rules that are common
    between XPath and XQuery. 
+ NW: The diffs are awful, they don’t deal with the notation changes.
+ MK: Where RD raised technical questions, I’ve managed to persuade
  myself that it’s only more explicit.
+ RD: I’m happy with the changes. The only minor thing is that in the
  generated output, the example blocks don’t have the proper styling.
+ MSM: An editorial point, hopefully not a bike-shedding issue, you
  are using the notation “itemtype-subtype” with two arguments as a
  more verbose way of notating the subtype relation. But my instinct
  is that if you are going to name a binary relation for the types or
  roles of its arguments, the order of the name should be the same as
  the name of the arguments. So, change the order or change the name
  to “subtype-itemtype”
+ MK: I kept the function notation basically in case people refer to it.
+ MSM: So that pseudo function with its backwards arguments, as I see
  it, is a ship that has sailed.
+ MK: Yes. And it always confused me which is why I got rid of it.

Proposal: Accept this PR?

Accepted.

** Review pull request #207: new expanded-QName function
:PROPERTIES:
:CUSTOM_ID: h-743C4A9D-BAEF-4C75-A412-BDFAA9C89856
:END:

See [[https://qt4cg.org/dashboard/#pr-207][pull request #207]]

+ RD: The spec references braced URI literal, which is the “U{“ part
  of the construct. What it needs to be is the “URI qualified name”
  instead. That’s the “Q{}local-name”.
+ MK: Uhm…
+ RD: If you look at the expanded QName section.
+ MK: Yes, you’re right. 

+ MSM: I think there’s another place where braced URI literal is
  referred to that should perhaps be expanded QName. I’m looking at
  F&O section 10.1.2 under ~fn:parse-QName()~.

ACTION QT4CG-011-03: MK to change the references to URI qualified name in both QName-related functions.

+ MK: In the last paragraph, the reference to ~BracedURILiteral~ is ok.

Proposal: Accept the PR?

Accepted.

** Review pull request #215: parse-uri/build-uri
:PROPERTIES:
:CUSTOM_ID: h-11CAAAFD-8175-4D10-83FA-BEC6AA3312A6
:END:

See [[https://qt4cg.org/dashboard/#pr-215][pull request #215]]

Waiting on actions QT4CG-009-0{3,4,5,6,7} on NW.

+ RD: Make a separate subsection like RegEx pattern and point to it
  from both places.

ACTION QT4CG-011-04: NW to define the parse-uri/build-uri record types in a separate section

ACTION QT4CG-011-05: NW to update the history for parse-uri/build-uri to indicate that details are still being resolved

** Review pull request #222: sequence comparisons
:PROPERTIES:
:CUSTOM_ID: h-04B58DC1-A005-4AD5-83F0-B3BCE110FB76
:END:

See [[https://qt4cg.org/dashboard/#pr-222][pull request #222]]

Accepted at [[../../minutes/2022/11-01.html][meeting 009]], waiting for MK to resolve a merge conflict.

** Review pull request #228: make F&O spec valid XML
:PROPERTIES:
:CUSTOM_ID: h-37009862-494E-4CCE-9FA7-DE5B2E9F8474
:END:

See [[https://qt4cg.org/dashboard/#pr-228][pull request #228]]

Approved by RD, waiting for open PRs on F&O to be accepted, then NW
will resolve any merge conflicts that arise and commit it.

Proposal: Accept the PR (after resolving merge conflicts)?

Accepted.

** Review pull request #230: guarded expressions, issue #71
:PROPERTIES:
:CUSTOM_ID: h-A132F93F-0414-4495-A868-A7F32A6D642A
:END:

See [[https://qt4cg.org/dashboard/#pr-230][pull request #230]] and related [[https://github.com/qt4cg/qtspecs/issues/71][issue #71]].

Approved by CG.

+ MK: The section on errors and optimization, which was always
  troublesome, gives implementations an awful lot of license to
  rearrange expressions in ways that introduce and eliminate errors.
  There’s a very limited set of exceptions for conditional
  expressions. What this does is take out that text for conditional
  expressions from 2.3.4 and generalize it into the concept of guarded
  expressions in 2.3.5. It gives similar guarantees for a number of
  other cases: “and” and “or” expressions where it says the first is
  guarded by the second; the same for multiple predicates, they behave
  like “and”.
  + … It also says that for loops, if you pull something out of the
    loop, it can’t raise an error if the loop is executed zero times.
+ MSM: I’m not up to speed on this, if I’ve understood correctly, the
  upshot is that implementations can still reorder things, but if the
  reordered code raises an error, you have to work out if it would
  have raised the error in the original order.
+ JL: Why is this in XQuery instead of XPath?
+ MK: It’s in both.
+ DN: I fully support this, but it just touches on the surface and we
  need to consider the topic of short circuit operators. Many
  languages have short circuiting operators. Maybe we can consider
  allowing the programmer to specify hints about possible lazy evaluation.
+ MK: I’m very conscious that the whole treatment of error handling is
  still extremely informal and this is a small step in the direction
  of making it a bit more formal. Unfortunately, I’m not a formalist.
  It would be nice to have someone who could really do the formal
  semantics of error handling much more thoroughly.
  + … With respect to lazy evaluation, we’ve done hints before
    (ordered vs unordered) and they’ve been spectacularly
    unsuccessful. Implementors ignore them, users don’t understand
    them, so I have doubts about hints are likely to be of widespread
    benefit.
+ RD: There is a formal semantics for XPath/XQuery 1.0 but that got
  abandoned.

Proposal: Accept this PR?

Accepted.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.
