meeting/minutes/2022/11-15.html

<div id="outline-container-pr-subtyping" class="outline-3">
<h3 id="pr-subtyping"><span class="section-number-3">2.3.</span> Review pull request #202 (was 196; subtyping)</h3>
<div class="outline-text-3" id="text-pr-subtyping">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-202">pull request #202</a>
</p>

<ul class="org-ul">
<li>MK: The principle changes are to the section on defining subtyping
rules. There were two major comments on the original proposal: lots
of good detail from RD and a question of the fundamental nature of
atomic values from MSM. I propose to address the latter in a
different issue. 
<ul class="org-ul">
<li>… This primarily addresses the subtyping rules that are common
between XPath and XQuery.</li>
</ul></li>
<li>NW: The diffs are awful, they don’t deal with the notation changes.</li>
<li>MK: Where RD raised technical questions, I’ve managed to persuade
myself that it’s only more explicit.</li>
<li>RD: I’m happy with the changes. The only minor thing is that in the
generated output, the example blocks don’t have the proper styling.</li>
<li>MSM: An editorial point, hopefully not a bike-shedding issue, you
are using the notation “itemtype-subtype” with two arguments as a
more verbose way of notating the subtype relation. But my instinct
is that if you are going to name a binary relation for the types or
roles of its arguments, the order of the name should be the same as
the name of the arguments. So, change the order or change the name
to “subtype-itemtype”</li>
<li>MK: I kept the function notation basically in case people refer to it.</li>
<li>MSM: So that pseudo function with its backwards arguments, as I see
it, is a ship that has sailed.</li>
<li>MK: Yes. And it always confused me which is why I got rid of it.</li>
</ul>

<p>
Proposal: Accept this PR?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-h-743C4A9D-BAEF-4C75-A412-BDFAA9C89856" class="outline-3">
<h3 id="h-743C4A9D-BAEF-4C75-A412-BDFAA9C89856"><span class="section-number-3">2.4.</span> Review pull request #207: new expanded-QName function</h3>
<div class="outline-text-3" id="text-h-743C4A9D-BAEF-4C75-A412-BDFAA9C89856">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-207">pull request #207</a>
</p>

<ul class="org-ul">
<li>RD: The spec references braced URI literal, which is the “U{“ part
of the construct. What it needs to be is the “URI qualified name”
instead. That’s the “Q{}local-name”.</li>
<li>MK: Uhm…</li>
<li>RD: If you look at the expanded QName section.</li>
<li>MK: Yes, you’re right.</li>

<li>MSM: I think there’s another place where braced URI literal is
referred to that should perhaps be expanded QName. I’m looking at
F&amp;O section 10.1.2 under <code>fn:parse-QName()</code>.</li>
</ul>

<p>
ACTION QT4CG-011-03: MK to change the references to URI qualified name in both QName-related functions.
</p>

<ul class="org-ul">
<li>MK: In the last paragraph, the reference to <code>BracedURILiteral</code> is ok.</li>
</ul>

<p>
Proposal: Accept the PR?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-h-11CAAAFD-8175-4D10-83FA-BEC6AA3312A6" class="outline-3">
<h3 id="h-11CAAAFD-8175-4D10-83FA-BEC6AA3312A6"><span class="section-number-3">2.5.</span> Review pull request #215: parse-uri/build-uri</h3>
<div class="outline-text-3" id="text-h-11CAAAFD-8175-4D10-83FA-BEC6AA3312A6">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-215">pull request #215</a>
</p>

<p>
Waiting on actions QT4CG-009-0{3,4,5,6,7} on NW.
</p>

<ul class="org-ul">
<li>RD: Make a separate subsection like RegEx pattern and point to it
from both places.</li>
</ul>

<p>
ACTION QT4CG-011-04: NW to define the parse-uri/build-uri record types in a separate section
</p>

<p>
ACTION QT4CG-011-05: NW to update the history for parse-uri/build-uri to indicate that details are still being resolved
</p>
</div>
</div>

<div id="outline-container-h-04B58DC1-A005-4AD5-83F0-B3BCE110FB76" class="outline-3">
<h3 id="h-04B58DC1-A005-4AD5-83F0-B3BCE110FB76"><span class="section-number-3">2.6.</span> Review pull request #222: sequence comparisons</h3>
<div class="outline-text-3" id="text-h-04B58DC1-A005-4AD5-83F0-B3BCE110FB76">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-222">pull request #222</a>
</p>

<p>
Accepted at <a href="../../minutes/2022/11-01.html">meeting 009</a>, waiting for MK to resolve a merge conflict.
</p>
</div>
</div>

<div id="outline-container-h-37009862-494E-4CCE-9FA7-DE5B2E9F8474" class="outline-3">
<h3 id="h-37009862-494E-4CCE-9FA7-DE5B2E9F8474"><span class="section-number-3">2.7.</span> Review pull request #228: make F&amp;O spec valid XML</h3>
<div class="outline-text-3" id="text-h-37009862-494E-4CCE-9FA7-DE5B2E9F8474">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-228">pull request #228</a>
</p>

<p>
Approved by RD, waiting for open PRs on F&amp;O to be accepted, then NW
will resolve any merge conflicts that arise and commit it.
</p>

<p>
Proposal: Accept the PR (after resolving merge conflicts)?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-h-A132F93F-0414-4495-A868-A7F32A6D642A" class="outline-3">
<h3 id="h-A132F93F-0414-4495-A868-A7F32A6D642A"><span class="section-number-3">2.8.</span> Review pull request #230: guarded expressions, issue #71</h3>
<div class="outline-text-3" id="text-h-A132F93F-0414-4495-A868-A7F32A6D642A">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-230">pull request #230</a> and related <a href="https://github.com/qt4cg/qtspecs/issues/71">issue #71</a>.
</p>

<p>
Approved by CG.
</p>

<ul class="org-ul">
<li>MK: The section on errors and optimization, which was always
troublesome, gives implementations an awful lot of license to
rearrange expressions in ways that introduce and eliminate errors.
There’s a very limited set of exceptions for conditional
expressions. What this does is take out that text for conditional
expressions from 2.3.4 and generalize it into the concept of guarded
expressions in 2.3.5. It gives similar guarantees for a number of
other cases: “and” and “or” expressions where it says the first is
guarded by the second; the same for multiple predicates, they behave
like “and”.
<ul class="org-ul">
<li>… It also says that for loops, if you pull something out of the
loop, it can’t raise an error if the loop is executed zero times.</li>
</ul></li>
<li>MSM: I’m not up to speed on this, if I’ve understood correctly, the
upshot is that implementations can still reorder things, but if the
reordered code raises an error, you have to work out if it would
have raised the error in the original order.</li>
<li>JL: Why is this in XQuery instead of XPath?</li>
<li>MK: It’s in both.</li>
<li>DN: I fully support this, but it just touches on the surface and we
need to consider the topic of short circuit operators. Many
languages have short circuiting operators. Maybe we can consider
allowing the programmer to specify hints about possible lazy evaluation.</li>
<li>MK: I’m very conscious that the whole treatment of error handling is
still extremely informal and this is a small step in the direction
of making it a bit more formal. Unfortunately, I’m not a formalist.
It would be nice to have someone who could really do the formal
semantics of error handling much more thoroughly.
<ul class="org-ul">
<li>… With respect to lazy evaluation, we’ve done hints before
(ordered vs unordered) and they’ve been spectacularly
unsuccessful. Implementors ignore them, users don’t understand
them, so I have doubts about hints are likely to be of widespread
benefit.</li>
</ul></li>
<li>RD: There is a formal semantics for XPath/XQuery 1.0 but that got
abandoned.</li>
</ul>

<p>
Proposal: Accept this PR?
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
